"""Модуль констант для приложения tg."""

# Сообщение, которое сохраняет телеграм бота для отправки
# пользователю после нажатия оператором кнопки финиш.
FINISH_CHAT_MESSAGE = "Чат окончен."

# Отображать первые Х символов токена пользователя.
CHAT_TOKEN_SLICE_SIZE = 5

# Пауза между этапами работы тг-бота.
BETWEEN_STEPS_PAUSE_SECONDS = 2

# Периодичность запуска ТГ бота задачей Celeby Beat.
# Используется административной командой set_tg_bot_scheduleв приложении tg.
TG_BOT_START_INTERVAL_SECONDS = 15
